---
kind: other
id: Methods.T:Autodesk.Revit.DB.CombinableElement
source: html/bd48c8c7-4731-79b9-1fd5-67b7b3f22c72.htm
---
# CombinableElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.